apigee.svici.sys/Utilities/Data/RequestTemplates/Debit/BTRT02_Debit_Req.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:app="http://application.bpc.ru/">
	<soapenv:Header/>
	<soapenv:Body>
		<app:storeApplication>
			<uid>{0}</uid>
			<application id="{1}">
				<templateName>{2}</templateName>
				<instId>{3}</instId>
				<agentId>{4}</agentId>
				<block name="{5}">
					<blocks>
						<block name="CUSTOMER_BLOCK">
							<blocks>
								<block name="DOCUMENT_BLOCK">
									<fields>
										<field id="17">
											<name>Document Type</name>
											<valueString>{6}</valueString>
										</field>
										<field id="18">
											<name>Number</name>
											<valueString>{7}</valueString>
										</field>
									</fields>
								</block>
							</blocks>
							<fields>
								<field id="19">
									<name>Customer ID</name>
									<valueString>{8}</valueString>
								</field>
							</fields>
						</block>
						<block name="CARDHOLDER_BLOCK">
							<blocks>
								<block name="PERSON_BLOCK">
									<fields>
										<field id="24">
											<name>Person ID</name>
										</field>
										<field id="25">
											<name>First Name</name>
											<valueString>{9}</valueString>
										</field>
										<field id="27">
											<name>Surname</name>
											<valueString>{10}</valueString>
										</field>
										<field id="28">
											<name>Date of Birth</name>
											<valueDate>{11}</valueDate>
										</field>
										<field id="191">
											<name>Person processing mode</name>
											<valueNumber>{12}</valueNumber>
										</field>
										<field id="34">
											<name>Sex</name>
											<valueString>{13}</valueString>
										</field>
										<field id="17">
											<name>Type of the person"s ID</name>
											<valueString>{14}</valueString>
										</field>
										<field id="18">
											<name>Number of the person"s ID</name>
											<valueString>{15}</valueString>
										</field>
									</fields>
								</block>
								<block name="ADDRESS_BLOCK">
									<fields>
										<field id="78">
											<name>Address ID</name>
										</field>
										<field id="79">
											<name>Address Type</name>
											<valueString>{16}</valueString>
										</field>
										<field id="190">
											<name>Address processing mode</name>
											<valueNumber>{17}</valueNumber>
										</field>
										<field id="81">
											<name>Address Line 1</name>
											<valueString>{18}</valueString>
										</field>
										<field id="82">
											<name>Address Line 2</name>
											<valueString>{19}</valueString>
										</field>
										<field id="85">
											<name>Region</name>
											<valueString>{20}</valueString>
										</field>
										<field id="88">
											<name>Primary Phone</name>
											<valueString>{21}</valueString>
										</field>
										<field id="89">
											<name>Secondary Phone</name>
											<valueString>{22}</valueString>
										</field>
										<field id="90">
											<name>Mobile Phone</name>
											<valueString>{23}</valueString>
										</field>
										<field id="92">
											<name>E-mail</name>
											<valueString>{24}</valueString>
										</field>
									</fields>
								</block>
							</blocks>
						</block>
						<block name="CARD_BLOCK">
							<blocks>
								<block name="CARD_INIT_BLOCK">
									<fields>
										<field id="44">
											<name>Card Number</name>
											<valueString>{25}</valueString>
										</field>
									</fields>
								</block>
								<block name="CARD_DATA_BLOCK">
									<fields>
										<field id="51">
											<name>Embossed Name</name>
											<valueString>{26}</valueString>
										</field>
										<field id="829">
											<name>Region list</name>
											<valueString>{27}</valueString>
										</field>
									</fields>
								</block>
							</blocks>
						</block>
						<block name="ACCOUNT_BLOCK">
							<blocks>
								<block name="ACCOUNT_INIT_BLOCK">
									<fields>
										<field id="60">
											<name>Account number</name>
											<valueString>{28}</valueString>
										</field>
										<field id="62">
											<name>Account Type</name>
											<valueString>{29}</valueString>
										</field>
									</fields>
								</block>
							</blocks>
						</block>
					</blocks>
				</block>
			</application>
		</app:storeApplication>
	</soapenv:Body>
</soapenv:Envelope>